Repository: florianika/asrdb-frontend
Catalog: src/locale/language.*.xlf
Languages: sq

source: Sign in to continue
sq: Kyçuni në llogari për të vazhduar

source: Enter your email
sq: Vendosni email-in tuaj

source: Password
sq: Fjalëkalimi

source: Enter your password
sq: Vendosni fjalëkalimin tuaj

source: Forgot password?
sq: Harruat fjalëkalimin?

source: Continue
sq: Vazhdo

source: Create an accoun
sq: Krijo nje llogari

source: Full name
sq: Emri i plotë

source: Enter your full name
sq: Vendosni emrin tuaj të plotë

source: Please provide your full name
sq: Ju lutemi, vendosni emrin tuaj të plotë

source: Please provide a valid email
sq: Ju lutemi, vendosni një adresë emaili të saktë

source: Please provide a valid password
sq: Ju lutemi, vendosni një fjalëkalim të saktë

source: Password should be at least 8 characters long
sq: Fjalëkalimi duhet të ketë të paktën 8 shkronja/numra

source: Retype password
sq: Rishkruaj fjalëkalimin

source: Retype your password
sq: Rishkruaj fjalëkalimin tënd

source: Already have an account? Sign in!
sq: Ke një llogari? Kyçu!
